brew "bat"
brew "chafa"
brew "freeze", tap: "charmbracelet/tap"
brew "colima"
brew "ctop"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "borders", tap: "felixkratz/formulae"
brew "fzf"
brew "gcc"
brew "gh"
brew "go"
brew "vela", tap: "go-vela/vela"
brew "jupyterlab"
brew "lazygit"
brew "libomp"
brew "luarocks"
brew "maven"
brew "neovim"
brew "peru"
brew "pipx"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "ruff"
brew "sd"
brew "socat"
brew "tgt-docker_helper_scripts", tap: "tgt/brewhouse"
brew "tokei"
brew "tree"
brew "tree-sitter-cli"
brew "virtualenv"
brew "worktrunk"
brew "yazi"
brew "yq"
brew "zoxide"
